<?php

//склоняем по падежам (дательный, родительный, винительный)

function makeRegionWordform($t,$form)
{
	global $wordform_reps;
	if(!is_array($wordform_reps))
	{
		$wordform_reps[2] = array("Республика Крым"=>"Крыму","область"=>"области","красная поляна"=>"Красной Поляне","Ростов-на-Дону"=>"Ростове-на-Дону","Старый Оскол"=>"Старом Осколе","Сочи"=>"Сочи","ия"=>"ии","ий"=>"ом","ый"=>"ом","ие"=>"ом","ея"=>"ее","ая"=>"ой","(ие о-ва|ие острова)"=>"их о-вах","нь"=>"ни","мь"=>"ми","(а|й|ь)"=>"е","ет"=>"те","(с|м|р|н|л|д|г|к|н|в)"=>"\\1е","ы"=>"ах","ши"=>"ах","ки"=>"ках","и"=>"ях","ж"=>"же");
		$wordform_reps[3] = array("Республика Крым"=>"Крыма","красная поляна"=>"Красной Поляны","Ростов-на-Дону"=>"Ростова-на-Дону","Старый Оскол"=>"Старого Оскола","Сочи"=>"Сочи","ия"=>"ии","ая"=>"ой","ка"=>"ки","ша"=>"ши","га"=>"ги","(ие о-ва|ие острова)"=>"их о-вов","а"=>"ы","ет"=>"та","ний"=>"него","ий"=>"ого","ые"=>"ых","ый"=>"ого","ая"=>"ой","й"=>"я","ы"=>"","(л)ь"=>"\\1я","([^л])ь"=>"\\1и","(с|м|р|л|д|г|к|н)"=>"\\1а","ж"=>"жа","в"=>"ва");
		$wordform_reps[4] = array("Республика Крым"=>"Крым","красная поляна"=>"Красную Поляну","Ростов-на-Дону"=>"Ростов-на-Дону","Старый Оскол"=>"Старый Оскол","Сочи"=>"Сочи","ия"=>"ию","ая"=>"ою","ка"=>"ку","ша"=>"шу","га"=>"гу","(ие о-ва|ие острова)"=>"их о-вов","а"=>"у","ет"=>"ту","ий"=>"ую","ые"=>"ую","ый"=>"ую","ая"=>"ую","й"=>"я","ы"=>"","(л)ь"=>"\\1я","([^л])ь"=>"\\1и","(с|м|р|л|д|г|к|н|в)"=>"\\1у","ж"=>"жу");
	}

	$lt = ruslow($t);
	foreach ($wordform_reps[$form] as $k=>$v)
		if ($lt == ruslow($k)) return $v;

	$aa = preg_split("/\s+/",$t);
	foreach ($aa as $t)
	{
		foreach ($wordform_reps[$form] as $k=>$v)
			if (preg_match("/".$k."$/",$t)) {$t = preg_replace("/".$k."$/",$v,$t);break;}
		if ($out!="") $out.=" ";
		$out.=$t;
	}
        return $out;

}

//приведение к нижнему регистру

function ruslow($s)
{
	return strtolower(strtr($s,"ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ","йцукенгшщзхъфывапролджэячсмитьбю"));
}

//приведение к верхнему регистру

function rusup($s)
{
	return strtoupper(strtr($s,"йцукенгшщзхъфывапролджэячсмитьбю","ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ"));
}


//вывод сетки постов из массива постов data в cols колонок. 

function printCols($data,$cols=2)
{
	foreach($data as $s)
	{
		$o[(int)($i/$cols)][$i%$cols]=$s;
		$i++;
	}

	foreach($o as $i=>$oo)
	{
		if(!$cols)
			$cols=(int)(12/count($oo));
		$out .= "<div class='row tbl'><div class='col-sm-".$cols."'>" . join("</div><div class='col-sm-".$cols."'>",$oo) . "</div></div>";

	}
	return $out;
}

?>